Телеграм/src/InformationRegisters/ОтветыПользователям/ОтветыПользователям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтветыПользователям</name>
  <resources>
    <name>Команда</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ИДОбновления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Собеседник</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ИДСобеседника</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ЛогинСобеседника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Телеграм/src/CommonModules/ФоновоеЗадание/Module.bsl
#Область ОтветНаСообщение
Процедура РегламентноеЗадание() Экспорт
	Ответ = ЧтениеСообщенийСервер.ОбновитьСообщенияНаСервере();
	ОбработатьОтвет(Ответ);
КонецПроцедуры

Процедура ОбработатьОтвет(Ответ)
	Набор = РегистрыСведений.ОтветыПользователям.СоздатьНаборЗаписей();
	Для Каждого Строка Из Ответ Цикл
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ОтветыПользователям.Команда
			|ИЗ
			|	РегистрСведений.ОтветыПользователям КАК ОтветыПользователям
			|ГДЕ
			|	ОтветыПользователям.ИДОбновления = &ИДОбновления";
		
		Запрос.УстановитьПараметр("ИДОбновления", Строка.ИДОбновления);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если Не ВыборкаДетальныеЗаписи.Следующий() Тогда
			СтрокаНаборы = Набор.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаНаборы, Строка);
		Иначе
			Строка.Отправлено = Истина;
		КонецЕсли;
		
	КонецЦикла;
	Набор.Записать();
	ОтправитьОтвет(Ответ);
КонецПроцедуры

Процедура ОтправитьОтвет(ТаблицаДанных)
	Для Каждого Строка Из ТаблицаДанных Цикл
		Если Не Строка.Отправлено Тогда
			ОбменСообщениямиСервер.ОтправитьСообщение(Строка.ИДСобеседника, "ок!");
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры
#КонецОбласти
